# -*- coding: utf-8 -*-

import pymysql
import jieba


stop_words = [
    "的", "和", "与", "在", "中", "通过", "等", "对", "将", "为", "是", "对于","见解","思路","作品集","成功","可用性","动效","原型","自营","年终","剪映",
    "可以", "有", "也", "我们", "不", "但", "如果", "或", "那么", "这", "这些", "那", "被","三年","文字","照片","气氛","合成","公众","17","年轻","创作","品牌形象",
    "因为", "然后", "一种", "一个", "没有", "此", "以", "到", "由", "它", "他", "她", "你","开发人员","还原","效果图","切图","建立","App","元素","手绘","同事",
    "我", "们", "其", "那些", "之", "不是", "这样", "已经", "可能", "什么", "哪", "哪里","各项","兴趣","基本工资","领悟","线下","选择","基本","各项","并且","各项",
    "如何", "为什么", "所有", "关于", "再", "更", "很", "还", "就", "而", "要", "此外",
    "从", "让", "使", "因", "由于", "即", "如", "比如", "而且", "当", "使得", "却", "所以",
    "只是", "但是", "除了", "这个", "那个", "除", "以外", "即使", "虽然", "尽管", "即便",
    "产出", "结果",  "分享", "保持","若干名", "多名", "若干", "若干职位", "若干岗位", "若干空缺","近日", "最新", "现因业务拓展", "即日起", "截止日期","有意者", "请发送", "简历至", "欢迎投递", "投递邮箱", "联系方式",
    "待遇", "福利", "办公环境", "发展空间", "晋升通道", "地理位置","兼容","兼容问题","统一","浏览器","孪生","材质","阿里","说明书",
    "交通便利", "轻松氛围", "年轻团队", "扁平化管理", "下午茶", "弹性工作",
    "期待您的加入", "共创辉煌", "携手共进", "一起成长",
    "啊", "阿", "哎", "哎呀", "哎哟", "唉", "俺", "俺们", "按", "按照", "吧", "吧哒", "把", "罢了", "被", "本", "本着", "比", "比方", "比如", "鄙人", "彼", "彼此", "边", "别", "别的", "别说", "并", "并且", "不比", "不成", "不单", "不但", "不独", "不管", "不光", "不过", "不仅", "不拘", "不论", "不怕", "不然", "不如", "不特", "不惟", "不问", "不只", "朝", "朝着", "趁", "趁着", "乘", "冲", "除", "除此之外", "除非", "除了", "此", "此间", "此外", "从", "从而", "打", "待", "但", "但是", "当", "当着", "到", "得", "的", "的话", "等", "等等", "地", "第", "叮咚", "对", "对于", "多", "多少", "而", "而况", "而且", "而是", "而外", "而言", "而已", "尔后", "反过来", "反过来说", "反之", "非但", "非徒", "否则", "嘎", "嘎登", "该", "赶", "个", "各", "各个", "各位", "各种", "各自", "给", "根据", "跟", "故", "故此", "固然", "关于", "管", "归", "果然", "果真", "过", "哈", "哈哈", "呵", "和", "何", "何处", "何况", "何时", "嘿", "哼", "哼唷", "呼哧", "乎", "哗", "还是", "还有", "换句话说", "换言之", "或", "或是", "或者", "极了", "及", "及其", "及至", "即", "即便", "即或", "即令", "即若", "即使", "几", "几时", "己", "既", "既然", "既是", "继而", "加之", "假如", "假若", "假使", "鉴于", "将", "较", "较之", "叫", "接着", "结果", "借", "紧接着", "进而", "尽", "尽管", "经", "经过", "就", "就是", "就是说", "据", "具体地说", "具体说来", "开始", "开外", "靠", "咳", "可", "可见", "可是", "可以", "况且", "啦", "来", "来着", "离", "例如", "哩", "连", "连同", "两者", "了", "临", "另", "另外", "另一方面", "论", "嘛", "吗", "慢说", "漫说", "冒", "么", "每", "每当", "们", "莫若", "某", "某个", "某些", "拿", "哪", "哪边", "哪儿", "哪个", "哪里", "哪年", "哪怕", "哪天", "哪些", "哪样", "那", "那边", "那儿", "那个", "那会儿", "那里", "那么", "那么些", "那么样", "那时", "那些", "那样", "乃", "乃至", "呢", "能", "你", "你们", "您", "宁", "宁可", "宁肯", "宁愿", "哦", "呕", "啪达", "旁人", "呸", "凭", "凭借", "其", "其次", "其二", "其他", "其它", "其一", "其余", "其中", "起", "起见", "岂但", "恰恰相反", "前后", "前者", "且", "然而", "然后", "然则", "让", "人家", "任", "任何", "任凭", "如", "如此", "如果", "如何", "如其", "如若", "如上所述", "若", "若非", "若是", "啥", "上下", "尚且", "设若", "设使", "甚而", "甚么", "甚至", "省得", "时候", "什么", "什么样", "使得", "是", "是的", "首先", "谁", "谁知", "顺", "顺着", "似的", "虽", "虽然", "虽说", "虽则", "随", "随着", "所", "所以", "他", "他们", "他人", "它", "它们", "她", "她们", "倘", "倘或", "倘然", "倘若", "倘使", "腾", "替", "通过", "同", "同时", "哇", "万一", "往", "望", "为", "为何", "为了", "为什么", "为着", "喂", "嗡嗡", "我", "我们", "呜", "呜呼", "乌乎", "无论", "无宁", "毋宁", "嘻", "吓", "相对而言", "像", "向", "向着", "嘘", "呀", "焉", "沿", "沿着", "要", "要不", "要不然", "要不是", "要么", "要是", "也", "也罢", "也好", "一", "一般", "一旦", "一方面", "一来", "一切", "一样", "一则", "依", "依照", "矣", "以", "以便", "以及", "以免", "以至", "以至于", "以致", "抑或", "因", "因此", "因而", "因为", "哟", "用", "由", "由此可见", "由于", "有", "有的", "有关", "有些", "又", "于", "于是", "于是乎", "与", "与此同时", "与否", "与其", "越是", "云云", "哉", "再说", "再者", "在", "在下", "咱", "咱们", "则", "怎", "怎么", "怎么办", "怎么样", "怎样", "咋", "照", "照着", "者", "这", "这边", "这儿", "这个", "这会儿", "这就是说", "这里", "这么", "这么点儿", "这么些", "这么样", "这时", "这些", "这样", "正如", "吱", "之", "之类", "之所以", "之一", "只是", "只限", "只要", "只有", "至", "至于", "诸位", "着", "着呢", "自", "自从",
    "采集", "修正",  "高通", "海外", "iOS", "消息", "专业本科", "应聘", "对外",
    "面议", "勿扰", "试稿", "放假", "挑战", "改版", "动态",
    "自个儿", "自各儿", "自己", "自家", "自身", "综上所述", "总的来看", "总的来说", "总的说来", "总而言之", "总之", "纵", "纵令", "纵然", "纵使", "遵照", "作为", "兮", "呃", "呗", "咚", "咦", "喏", "啐", "喔唷", "嗬", "嗯", "嗳", "啊哈", "啊呀", "啊哟", "挨次", "挨个", "挨家挨户", "挨门挨户", "挨门逐户", "挨着", "按理", "按期", "按时", "按说", "暗地里", "暗中", "暗自", "昂然", "八成", "白白", "半", "梆", "保管", "保险", "饱", "背地里", "背靠背", "倍感", "倍加", "本人", "本身", "甭", "比起", "比如说", "比照", "毕竟", "必", "必定", "必将", "必须", "便", "别人", "并非", "并肩", "并没", "并没有", "并排", "并无", "勃然", "不", "不必", "不常", "不大", "不得", "不得不", "不得已", "不迭", "不定", "不对", "不妨", "不管怎样", "不会", "不仅仅", "不仅仅是", "不经意", "不可开交", "不可抗拒", "不力", "不了", "不料", "不满", "不免", "不能不", "不起", "不巧", "不然的话", "不日", "不少", "不胜", "不时", "不是", "不同", "不能", "不要", "不外", "不外乎", "不下", "不限", "不消", "不已", "不亦乐乎", "不由得", "不再", "不择手段", "不怎么", "不曾", "不知不觉", "不止", "不止一次", "不至于", "才", "才能", "策略地", "差不多", "差一点", "常", "常常", "常言道", "常言说", "常言说得好", "长此下去", "长话短说", "长期以来", "长线", "敞开儿", "彻夜", "陈年", "趁便", "趁机", "趁热", "趁势", "趁早", "成年", "成年累月", "成心", "乘机", "乘胜", "乘势", "乘隙", "乘虚", "诚然", "迟早", "充分", "充其极", "充其量", "抽冷子", "臭", "初", "出", "出来", "出去", "除此", "除此而外", "除此以外", "除开", "除去", "除外", "处处", "川流不息", "传", "传说", "传闻", "串行", "纯", "纯粹", "此后", "此中", "次第", "匆匆", "从不", "从此", "从此以后", "从古到今", "从古至今", "从今以后", "从宽", "从来", "从轻", "从速", "从头", "从未", "从无到有", "从小", "从新", "从严", "从优", "从早到晚", "从中", "从重", "凑巧", "粗", "存心", "达旦", "打从", "打开天窗说亮话", "大", "大不了", "大大", "大抵", "大都", "大多", "大凡", "大概", "大家", "大举", "大略", "大面儿上", "大事", "大体", "大体上", "大约", "大张旗鼓", "大致", "呆呆地", "带", "殆", "待到", "单", "单纯", "单单", "但愿", "弹指之间", "当场", "当儿", "当即", "当口儿", "当然", "当庭", "当头", "当下", "当真", "当中", "倒不如", "倒不如说", "倒是", "到处", "到底", "到了儿", "到目前为止", "到头", "到头来", "得起", "得天独厚", "的确", "等到", "叮当", "顶多", "定", "动不动", "动辄", "陡然", "都", "独", "独自", "断然", "顿时", "多次", "多多", "多多少少", "多多益善", "多亏", "多年来", "多年前", "而后", "而论", "而又", "尔等", "二话不说", "二话没说", "反倒", "反倒是", "反而", "反手", "反之亦然", "反之则", "方", "方才", "方能", "放量", "非常", "非得", "分期", "分期分批", "分头", "奋勇", "愤然", "风雨无阻", "逢", "弗", "甫", "嘎嘎", "该当", "概", "赶快", "赶早不赶晚", "敢", "敢情", "敢于", "刚", "刚才", "刚好", "刚巧", "高低", "格外", "隔日", "隔夜", "个人", "各式", "更", "更加", "更进一步", "更为", "公然", "共", "共总", "够瞧的", "姑且", "古来", "故而", "故意", "固", "怪", "怪不得", "惯常", "光", "光是", "归根到底", "归根结底", "过于", "毫不", "毫无", "毫无保留地", "毫无例外", "好在", "何必", "何尝", "何妨", "何苦", "何乐而不为", "何须", "何止", "很", "很多", "很少", "轰然", "后来", "呼啦", "忽地", "忽然", "互", "互相", "哗啦", "话说", "还", "恍然", "会", "豁然", "活", "伙同", "或多或少", "或许", "基本", "基本上", "基于", "极", "极大", "极度", "极端", "极力", "极其", "极为", "急匆匆", "即将", "即刻", "即是说", "几度", "几番", "几乎", "几经", "既…又", "继之", "加上", "加以", "间或", "简而言之", "简言之", "简直", "见", "将才", "将近", "将要", "交口", "较比", "较为", "接连不断", "接下来", "皆可", "截然", "截至", "藉以", "借此", "借以", "届时", "仅", "仅仅", "谨", "进来", "进去", "近", "近几年来", "近来", "近年来", "尽管如此", "尽可能", "尽快",
    "尽然", "尽如人意", "尽心竭力", "尽心尽力", "尽早", "精光", "经常", "竟", "竟然", "究竟", "就此", "就地", "就算", "居然", "局外", "举凡", "据称", "据此", "据实", "据说", "据我所知", "据悉", "具体来说", "决不", "决非", "绝", "绝不", "绝顶", "绝对", "绝非", "均", "喀", "看", "看来", "看起来", "看上去", "看样子", "可好", "可能", "恐怕", "快", "快要", "来不及", "来得及", "来讲", "来看", "拦腰", "牢牢", "老", "老大", "老老实实", "老是", "累次", "累年", "理当", "理该", "理应", "历", "立", "立地", "立刻", "立马", "立时", "联袂", "连连", "连日", "连日来", "连声", "连袂", "临到", "另方面", "另行", "另一个", "路经", "屡", "屡次", "屡次三番", "屡屡", "缕缕", "率尔", "率然", "略", "略加", "略微", "略为", "论说", "马上", "蛮", "满", "没", "没有", "每逢", "每每", "每时每刻", "猛然", "猛然间", "莫", "莫不", "莫非", "莫如", "默默地", "默然", "呐", "那末", "奈", "难道", "难得", "难怪", "难说", "内", "年复一年", "凝神", "偶而", "偶尔", "怕", "砰", "碰巧", "譬如", "偏偏", "乒", "平素", "颇", "迫于", "扑通", "其后", "其实", "奇", "齐", "起初", "起来", "起首", "起头", "起先", "岂", "岂非", "岂止", "迄", "恰逢", "恰好", "恰恰", "恰巧", "恰如", "恰似", "千", "万", "千万", "千万千万", "切", "切不可", "切莫", "切切", "切勿", "窃", "亲口", "亲身", "亲手", "亲眼", "亲自", "顷", "顷刻", "顷刻间", "顷刻之间", "请勿", "穷年累月", "取道", "去", "权时", "全都", "全力", "全年", "全然", "全身心", "然", "人人", "仍", "仍旧", "仍然", "日复一日", "日见", "日渐", "日益", "日臻", "如常", "如此等等", "如次", "如今", "如期", "如前所述", "如上", "如下", "汝", "三番两次", "三番五次", "三天两头", "瑟瑟", "沙沙", "上", "上来", "上去", "一.", "一一", "一下", "一个", "一些", "一何", "一则通过", "一天", "一定", "一时", "一次", "一片", "一番", "一直", "一致", "一起", "一转眼", "一边", "一面", "上升", "上述", "上面", "下", "下列", "下去", "下来", "下面", "不一", "不久", "不变", "不可", "不够", "不尽", "不尽然", "不敢", "不断", "不若", "不足", "与其说", "专门", "且不说", "且说", "严格", "严重", "个别", "中小", "中间", "丰富", "为主", "为什麽", "为止", "为此", "主张", "主要", "举行", "乃至于", "之前", "之后", "之後", "也就是说", "也是", "了解", "争取", "二来", "云尔", "些", "亦", "产生", "人", "人们", "什麽", "今", "今后", "今天", "今年", "今後", "介于", "从事", "他是", "他的", "代替", "以上", "以下", "以为", "以前", "以后", "以外", "以後", "以故", "以期", "以来", "任务", "企图", "伟大", "似乎", "但凡", "何以", "余外", "你是", "你的", "使", "使用", "依据", "依靠", "便于", "促进", "保持", "做到", "傥然", "儿", "允许", "元／吨", "先不先", "先后", "先後", "先生", "全体", "全部", "全面", "共同", "具体", "具有", "兼之", "再", "再其次", "再则", "再有", "再次", "再者说", "决定", "准备", "凡", "凡是", "出于", "出现", "分别", "则甚", "别处", "别是", "别管", "前此", "前进", "前面", "加入", "加强", "十分", "即如", "却", "却不", "原来", "又及", "及时", "双方", "反应", "反映", "取得", "受到", "变成", "另悉", "只", "只当", "只怕", "只消", "叫做", "召开", "各人", "各地", "各级", "合理", "同一", "同样", "后", "后者", "后面", "向使", "周围", "呵呵", "咧", "唯有", "啷当", "喽", "嗡", "嘿嘿", "因了", "因着", "在于", "坚决", "坚持", "处在", "处理", "复杂", "多么", "多数", "大力", "大多数", "大批", "大量", "失去", "她是", "她的", "好", "好的", "好象", "如同", "如是", "始而", "存在", "孰料", "孰知", "它们的", "它是", "它的", "安全", "完全", "完成", "实现", "实际", "宣布", "容易", "密切", "对应", "对待", "对方", "对比", "小", "少数", "尔", "尔尔", "尤其", "就是了", "就要", "属于", "左右", "巨大", "巩固", "已", "已矣", "已经", "巴", "巴巴", "帮助", "并不", "并不是", "广大", "广泛", "应当", "应用", "应该", "庶乎", "庶几", "开展", "引起", "强烈", "强调", "归齐", "当前",
    "当地", "当时", "形成", "彻底", "彼时", "往往", "後来", "後面", "得了", "得出", "得到", "心里", "必然", "必要", "怎奈", "怎麽", "总是", "总结", "您们", "您是", "惟其", "意思", "愿意", "成为", "我是", "我的", "或则", "或曰", "战斗", "所在", "所幸", "所有", "所谓", "扩大", "掌握", "接著", "数/", "整个", "方便", "方面", "无", "无法", "既往", "明显", "明确", "是不是", "是否", "显然", "显著", "普通", "普遍", "曾", "曾经", "替代", "最", "最后", "最大", "最好", "最後", "最近", "最高", "有利", "有力", "有及", "有所", "有效", "有时", "有点", "有的是", "有着", "有著", "末##末", "本地", "来自", "来说", "构成", "某某", "根本", "欢迎", "欤", "正值", "正在", "正巧", "正常", "正是", "此地", "此处", "此时", "此次", "每个", "每天", "每年", "比及", "比较", "没奈何", "注意", "深入", "清楚", "满足", "然後", "特别是", "特殊", "特点", "犹且", "犹自", "现代", "现在", "甚且", "甚或", "甚至于", "用来", "由是", "由此", "目前", "直到", "直接", "相似", "相信", "相反", "相同", "相对", "相应", "相当", "相等", "看出", "看到", "看看", "看见", "真是", "真正", "眨眼", "矣乎", "矣哉", "知道", "确定", "种", "积极", "移动", "突出", "突然", "立即", "竟而", "第二", "类如", "练习", "组成", "结合", "继后", "继续", "维持", "考虑", "联系", "能否", "能够", "自后", "自打", "至今", "至若", "致", "般的", "良好", "若夫", "若果", "范围", "莫不然", "获得", "行为", "行动", "表明", "表示", "要求", "规定", "觉得", "譬喻", "认为", "认真", "认识", "许多", "设或", "诚如", "说明", "说来", "说说", "诸", "诸如", "谁人", "谁料", "贼死", "赖以", "距", "转动", "转变", "转贴", "达到", "迅速", "过去", "过来", "运用", "还要", "这一来", "这次", "这点", "这种", "这般", "这麽", "进入", "进步", "进行", "适应", "适当", "适用", "逐步", "逐渐", "通常", "造成", "遇到", "遭到", "遵循", "避免", "那般", "那麽", "部分", "采取", "里面", "重大", "重新", "重要", "针对", "问题", "防止", "附近", "限制", "随后", "随时", "随著", "难道说", "集中", "需要", "非特", "非独", "高兴", "若果",
    "?", "\"", "》", "－－", "able", "about", "above", "according", "accordingly", "across", "actually", "after", "afterwards", "again", "against", "ain't", "all", "allow", "allows", "almost", "alone", "along", "already", "also", "although", "always", "am", "among", "amongst", "an", "and", "another", "any", "anybody", "anyhow", "anyone", "anything", "anyway", "anyways", "anywhere", "apart", "appear", "appreciate", "appropriate", "are", "aren't", "around", "as", "a's", "aside", "ask", "asking", "associated", "at", "available", "away", "awfully", "be", "became", "because", "become", "becomes", "becoming", "been", "before", "beforehand", "behind", "being", "believe", "below", "beside", "besides", "best", "better", "between", "beyond", "both", "brief", "but", "by", "came", "can", "cannot", "cant", "can't", "cause", "causes", "certain", "certainly", "changes", "clearly", "c'mon", "co", "com", "come", "comes", "concerning", "consequently", "consider", "considering", "contain", "containing", "contains", "corresponding", "could", "couldn't", "course", "c's", "currently", "definitely", "described", "despite", "did", "didn't", "different", "do", "does", "doesn't", "doing", "done", "don't", "down", "downwards", "during", "each", "edu", "eg", "eight", "either", "else", "elsewhere", "enough", "entirely", "especially", "et", "etc", "even", "ever", "every", "everybody", "everyone", "everything", "everywhere", "ex", "exactly", "example", "except", "far", "few", "fifth", "first", "five", "followed", "following", "follows", "for", "former", "formerly", "forth", "four", "from", "further", "furthermore", "get", "gets", "getting", "given", "gives", "go", "goes", "going", "gone", "got", "gotten", "greetings", "had", "hadn't", "happens", "hardly", "has", "hasn't", "have", "haven't", "having", "he", "hello", "help", "hence", "her", "here", "hereafter", "hereby", "herein", "here's", "hereupon", "hers", "herself", "he's", "hi", "him", "himself", "his", "hither", "hopefully", "how", "howbeit", "however", "i'd", "ie", "if", "ignored", "i'll", "i'm", "immediate", "in", "inasmuch", "inc", "indeed", "indicate", "indicated", "indicates", "inner", "insofar", "instead", "into", "inward", "is", "isn't", "it", "it'd", "it'll", "its", "it's", "itself", "i've", "just", "keep", "keeps", "kept", "know", "known", "knows", "last", "lately", "later", "latter", "latterly", "least", "less", "lest", "let", "let's", "like", "liked", "likely", "little", "look", "looking", "looks", "ltd", "mainly", "many", "may", "maybe", "me", "mean", "meanwhile", "merely", "might", "more", "moreover", "most", "mostly", "much", "must", "my", "myself", "name", "namely", "nd", "near", "nearly", "necessary", "need", "needs", "neither", "never", "nevertheless", "new", "next", "nine", "no", "nobody", "non", "none", "noone", "nor", "normally", "not", "nothing", "novel", "now", "nowhere", "obviously", "of", "off", "often", "oh", "ok", "okay", "old", "on", "once", "one", "ones", "only", "onto", "or", "other", "others", "otherwise", "ought", "our", "ours", "ourselves", "out", "outside", "over", "overall", "own", "particular", "particularly", "per", "perhaps", "placed", "please", "plus", "possible", "presumably", "probably", "provides", "que", "quite", "qv", "rather", "rd", "re", "really", "reasonably", "regarding", "regardless", "regards", "relatively", "respectively", "right", "said", "same", "saw", "say", "saying", "says", "second", "secondly", "see", "seeing", "seem", "seemed", "seeming", "seems", "seen", "self", "selves", "sensible", "sent", "serious", "seriously", "seven", "several", "shall", "she", "should", "shouldn't", "since", "six", "so", "some", "somebody", "somehow", "someone", "something", "sometime", "sometimes", "somewhat", "somewhere", "soon", "sorry", "specified", "specify", "specifying", "still", "sub", "such", "sup", "sure", "take", "taken", "tell", "tends", "th", "than", "thank", "thanks", "thanx", "that", "thats", "that's", "the", "their", "theirs", "them", "themselves", "then", "thence", "there", "thereafter", "thereby", "therefore", "therein", "theres", "thereupon", "these", "they", "they'd", "they'll", "they're", "they've", "think", "third", "this", "thorough", "thoroughly", "those", "though", "three", "through", "throughout", "thru",
    "to", "together", "too", "took", "toward", "towards", "tried", "tries", "truly", "try", "trying", "t's", "twice", "two", "un", "under", "unfortunately", "unless", "unlikely", "until", "unto", "up", "upon", "us", "use", "used", "useful", "uses", "using", "usually", "value", "various", "very", "via", "viz", "vs", "want", "wants", "was", "wasn't", "way", "we", "we'd", "welcome", "well", "we'll", "went", "were", "we're", "weren't", "we've", "what", "whatever", "what's", "when", "whence", "whenever", "where", "whereafter", "whereas", "whereby", "wherein", "where's", "whereupon", "wherever", "whether", "which", "while", "whither", "who", "whoever", "whole", "whom", "who's", "whose", "why", "will", "willing", "wish", "with", "within", "without", "wonder", "won't", "would", "wouldn't", "yes", "you", "you'd", "you'll", "your", "you're", "yours", "yourself", "yourselves", "you've", "zero", "zt", "ZT", "zz", "ZZ", "一", "一下", "一些", "一切", "一则", "一天", "一定", "一方面", "一旦", "一时", "一来", "一样", "一次", "一片", "一直", "一致", "一般", "一起", "一边", "一面", "万一", "上下", "上升", "上去", "上来", "上述", "上面", "下列", "下去", "下来", "下面", "不一", "不久", "不仅", "不会", "不但", "不光", "不单", "不变", "不只", "不可", "不同", "不够", "不如", "不得", "不怕", "不惟", "不成", "不拘", "不敢", "不断", "不是", "不比", "不然", "不特", "不独", "不管", "不能", "不要", "不论", "不足", "不过", "不问", "与", "与其", "与否", "与此同时", "专门", "且", "两者", "严格", "严重", "个", "个人", "个别", "中小", "中间", "丰富", "临", "为", "为主", "为了", "为什么", "为什麽", "为何", "为着", "主张", "主要", "举行", "乃", "乃至", "么", "之", "之一", "之前", "之后", "之後", "之所以", "之类", "乌乎", "乎", "乘", "也", "也好", "也是", "也罢", "了", "了解", "争取", "于", "于是", "于是乎", "云云", "互相", "产生", "人们", "人家", "什么", "什么样", "什麽", "今后", "今天", "今年", "今後", "仍然", "从", "从事", "从而", "他", "他人", "他们", "他的", "代替", "以", "以上", "以下", "以为", "以便", "以免", "以前", "以及", "以后", "以外", "以後", "以来", "以至", "以至于", "以致", "们", "任", "任何", "任凭", "任务", "企图", "伟大", "似乎", "似的", "但", "但是", "何", "何况", "何处", "何时", "作为", "你", "你们", "你的", "使得", "使用", "例如", "依", "依照", "依靠", "促进", "保持", "俺", "俺们", "倘", "倘使", "倘或", "倘然", "倘若", "假使", "假如", "假若", "做到", "像", "允许", "充分", "先后", "先後", "先生", "全部", "全面", "兮", "共同", "关于", "其", "其一", "其中", "其二", "其他", "其余", "其它", "其实", "其次", "具体", "具体地说", "具体说来", "具有", "再者", "再说", "冒", "冲", "决定", "况且", "准备", "几", "几乎", "几时", "凭", "凭借", "出去", "出来", "出现", "分别", "则", "别", "别的", "别说", "到", "前后", "前者", "前进", "前面", "加之", "加以", "加入", "加强", "十分", "即", "即令", "即使", "即便", "即或", "即若", "却不", "原来", "又", "及", "及其", "及时", "及至", "双方", "反之", "反应", "反映", "反过来", "反过来说", "取得", "受到", "变成", "另", "另一方面", "另外", "只是", "只有", "只要", "只限", "叫", "叫做", "召开", "叮咚", "可", "可以", "可是", "可能", "可见", "各", "各个", "各人", "各位", "各地", "各种", "各级", "各自", "合理", "同", "同一", "同时", "同样", "后来", "后面", "向", "向着", "吓", "吗", "否则", "吧", "吧哒", "吱", "呀", "呃", "呕", "呗", "呜", "呜呼", "呢", "周围", "呵", "呸", "呼哧", "咋", "和", "咚", "咦", "咱", "咱们", "咳", "哇", "哈", "哈哈", "哉", "哎", "哎呀", "哎哟", "哗", "哟", "哦", "哩", "哪", "哪个", "哪些", "哪儿", "哪天", "哪年", "哪怕", "哪样", "哪边", "哪里", "哼", "哼唷", "唉", "啊", "啐", "啥", "啦", "啪达", "喂", "喏", "喔唷", "嗡嗡", "嗬", "嗯", "嗳", "嘎", "嘎登", "嘘", "嘛", "嘻", "嘿", "因", "因为", "因此", "因而", "固然",
    "在下", "地", "坚决", "坚持", "基本", "处理", "复杂", "多", "多少", "多数", "多次", "大力", "大多数", "大大", "大家", "大批", "大约", "大量", "失去", "她", "她们", "她的", "好的", "好象", "如", "如上所述", "如下", "如何", "如其", "如果", "如此", "如若", "存在", "宁", "宁可", "宁愿", "宁肯", "它", "它们", "它们的", "它的", "安全", "完全", "完成", "实现", "实际", "宣布", "容易", "密切", "对", "对于", "对应", "将", "少数", "尔后", "尚且", "尤其", "就", "就是", "就是说", "尽", "尽管", "属于", "岂但", "左右", "巨大", "巩固", "己", "已经", "帮助", "常常", "并", "并不", "并不是", "并且", "并没有", "广大", "广泛", "应当", "应用", "应该", "开外", "开始", "开展", "引起", "强烈", "强调", "归", "当", "当前", "当时", "当然", "当着", "形成", "彻底", "彼", "彼此", "往", "往往", "待", "後来", "後面", "得", "得出", "得到", "心里", "必然", "必要", "必须", "怎", "怎么", "怎么办", "怎么样", "怎样", "怎麽", "总之", "总是", "总的来看", "总的来说", "总的说来", "总结", "总而言之", "恰恰相反", "您", "意思", "愿意", "慢说", "成为", "我", "我们", "我的", "或", "或是", "或者", "战斗", "所", "所以", "所有", "所谓", "打", "扩大", "把", "抑或", "拿", "按", "按照", "换句话说", "换言之", "据", "掌握", "接着", "接著", "故", "故此", "整个", "方便", "方面", "旁人", "无宁", "无法", "无论", "既", "既是", "既然", "时候", "明显", "明确", "是", "是否", "是的", "显然", "显著", "普通", "普遍", "更加", "曾经", "替", "最后", "最大", "最好", "最後", "最近", "最高", "有", "有些", "有关", "有利", "有力", "有所", "有效", "有时", "有点", "有的", "有着", "有著", "望", "朝", "朝着", "本", "本着", "来", "来着", "极了", "构成", "果然", "果真", "某", "某个", "某些", "根据", "根本", "欢迎", "正在", "正如", "正常", "此", "此外", "此时", "此间", "毋宁", "每", "每个", "每天", "每年", "每当", "比", "比如", "比方", "比较", "毫不", "没有", "沿", "沿着", "注意", "深入", "清楚", "满足", "漫说", "焉", "然则", "然后", "然後", "然而", "照", "照着", "特别是", "特殊", "特点", "现代", "现在", "甚么", "甚而", "甚至", "用", "由", "由于", "由此可见", "的", "的话", "目前", "直到", "直接", "相似", "相信", "相反", "相同", "相对", "相对而言", "相应", "相当", "相等", "省得", "看出", "看到", "看来", "看看", "看见", "真是", "真正", "着", "着呢", "矣", "知道", "确定", "离", "积极", "移动", "突出", "突然", "立即", "第", "等", "等等", "管", "紧接着", "纵", "纵令", "纵使", "纵然", "练习", "组成", "经", "经常", "经过", "结合", "结果", "给", "绝对", "继续", "继而", "维持", "综上所述", "罢了", "考虑", "者", "而", "而且", "而况", "而外", "而已", "而是", "而言", "联系", "能", "能否", "能够", "腾", "自", "自个儿", "自从", "自各儿", "自家", "自己", "自身", "至", "至于", "良好", "若", "若是", "若非", "范围", "莫若", "获得", "虽", "虽则", "虽然", "虽说", "行为", "行动", "表明", "表示", "被", "要", "要不", "要不是", "要不然", "要么", "要是", "要求", "规定", "觉得", "认为", "认真", "认识", "让", "许多", "论", "设使", "设若", "该", "说明", "诸位", "谁", "谁知", "赶", "起", "起来", "起见", "趁", "趁着", "越是", "跟", "转动", "转变", "转贴", "较", "较之", "边", "达到", "迅速", "过", "过去", "过来", "运用", "还是", "还有", "这", "这个", "这么", "这么些", "这么样", "这么点儿", "这些", "这会儿", "这儿", "这就是说", "这时", "这样", "这点", "这种", "这边", "这里", "这麽", "进入", "进步", "进而", "进行", "连", "连同", "适应", "适当", "适用", "逐步", "逐渐", "通常", "通过", "造成", "遇到", "遭到", "那", "那个", "那么", "那么些", "那么样", "那些", "那会儿", "那儿", "那时", "那样", "那边", "那里", "那麽", "部分", "鄙人", "采取", "里面", "重大", "重新", "重要", "鉴于", "问题", "防止", "阿", "附近", "限制", "除", "除了", "除此之外", "除非", "随", "随着", "随著", "集中", "需要", "非但", "非常", "非徒", "靠", "顺", "顺着", "首先", "高兴", "是不是", "说说",
    "$", "0", "1", "2", "3", "4", "5", "6", "7", "8", "9", "?", "_", "“", "”", "、", "。", "《", "》", "一", "一些", "一何", "一切", "一则", "一方面", "一旦", "一来", "一样", "一般", "一转眼", "万一", "上", "上下", "下", "不", "不仅", "不但", "不光", "不单", "不只", "不外乎", "不如", "不妨", "不尽", "不尽然", "不得", "不怕", "不惟", "不成", "不拘", "不料", "不是", "不比", "不然", "不特", "不独", "不管", "不至于", "不若", "不论", "不过", "不问", "与", "与其", "与其说", "与否", "与此同时", "且", "且不说", "且说", "两者", "个", "个别", "临", "为", "为了", "为什么", "为何", "为止", "为此", "为着", "乃", "乃至", "乃至于", "么", "之", "之一", "之所以", "之类", "乌乎", "乎", "乘", "也", "也好", "也罢", "了", "二来", "于", "于是", "于是乎", "云云", "云尔", "些", "亦", "人", "人们", "人家", "什么", "什么样", "今", "介于", "仍", "仍旧", "从", "从此", "从而", "他", "他人", "他们", "以", "以上", "以为", "以便", "以免", "以及", "以故", "以期", "以来", "以至", "以至于", "以致", "们", "任", "任何", "任凭", "似的", "但", "但凡", "但是", "何", "何以", "何况", "何处", "何时", "余外", "作为", "你", "你们", "使", "使得", "例如", "依", "依据", "依照", "便于", "俺", "俺们", "倘", "倘使", "倘或", "倘然", "倘若", "借", "假使", "假如", "假若", "傥然", "像", "儿", "先不先", "光是", "全体", "全部", "兮", "关于", "其", "其一", "其中", "其二", "其他", "其余", "其它", "其次", "具体地说", "具体说来", "兼之", "内", "再", "再其次", "再则", "再有", "再者", "再者说", "再说", "冒", "冲", "况且", "几", "几时", "凡", "凡是", "凭", "凭借", "出于", "出来", "分别", "则", "则甚", "别", "别人", "别处", "别是", "别的", "别管", "别说", "到", "前后", "前此", "前者", "加之", "加以", "即", "即令", "即使", "即便", "即如", "即或", "即若", "却", "去", "又", "又及", "及", "及其", "及至", "反之", "反而", "反过来", "反过来说", "受到", "另", "另一方面", "另外", "另悉", "只", "只当", "只怕", "只是", "只有", "只消", "只要", "只限", "叫", "叮咚", "可", "可以", "可是", "可见", "各", "各个", "各位", "各种", "各自", "同", "同时", "后", "后者", "向", "向使", "向着", "吓", "吗", "否则", "吧", "吧哒", "吱", "呀", "呃", "呕", "呗", "呜", "呜呼", "呢", "呵", "呵呵", "呸", "呼哧", "咋", "和", "咚", "咦", "咧", "咱", "咱们", "咳", "哇", "哈", "哈哈", "哉", "哎", "哎呀", "哎哟", "哗", "哟", "哦", "哩", "哪", "哪个", "哪些", "哪儿", "哪天", "哪年", "哪怕", "哪样", "哪边", "哪里", "哼", "哼唷", "唉", "唯有", "啊", "啐", "啥", "啦", "啪达", "啷当", "喂", "喏", "喔唷", "喽", "嗡", "嗡嗡", "嗬", "嗯", "嗳", "嘎", "嘎登", "嘘", "嘛", "嘻", "嘿", "嘿嘿", "因", "因为", "因了", "因此", "因着", "因而", "固然", "在", "在下", "在于", "地", "基于", "处在", "多", "多么", "多少", "大", "大家", "她", "她们", "好", "如", "如上", "如上所述", "如下", "如何", "如其", "如同", "如是", "如果", "如此", "如若", "始而", "孰料", "孰知", "宁", "宁可", "宁愿", "宁肯", "它", "它们", "对", "对于", "对待", "对方", "对比", "将", "小", "尔", "尔后", "尔尔", "尚且", "就", "就是", "就是了", "就是说", "就算", "就要", "尽", "尽管", "尽管如此", "岂但", "己", "已", "已矣", "巴", "巴巴", "并", "并且", "并非", "庶乎", "庶几", "开外", "开始", "归", "归齐", "当", "当地", "当然", "当着", "彼", "彼时", "彼此", "往", "待", "很", "得", "得了", "怎", "怎么", "怎么办", "怎么样", "怎奈", "怎样", "总之", "总的来看", "总的来说", "总的说来", "总而言之", "恰恰相反", "您", "惟其", "慢说", "我", "我们", "或", "或则", "或是", "或曰", "或者", "截至", "所", "所以", "所在",
    "所幸", "所有", "才", "才能", "打", "打从", "把", "抑或", "拿", "按", "按照", "换句话说", "换言之", "据", "据此", "接着", "故", "故此", "故而", "旁人", "无", "无宁", "无论", "既", "既往", "既是", "既然", "时候", "是", "是以", "是的", "曾", "替", "替代", "最", "有", "有些", "有关", "有及", "有时", "有的", "望", "朝", "朝着", "本", "本人", "本地", "本着", "本身", "来", "来着", "来自", "来说", "极了", "果然", "果真", "某", "某个", "某些", "某某", "根据", "欤", "正值", "正如", "正巧", "正是", "此", "此地", "此处", "此外", "此时", "此次", "此间", "毋宁", "每", "每当", "比", "比及", "比如", "比方", "没奈何", "沿", "沿着", "漫说", "焉", "然则", "然后", "然而", "照", "照着", "犹且", "犹自", "甚且", "甚么", "甚或", "甚而", "甚至", "甚至于", "用", "用来", "由", "由于", "由是", "由此", "由此可见", "的", "的确", "的话", "直到", "相对而言", "省得", "看", "眨眼", "着", "着呢", "矣", "矣乎", "矣哉", "离", "竟而", "第", "等", "等到", "等等", "简言之", "管", "类如", "紧接着", "纵", "纵令", "纵使", "纵然", "经", "经过", "结果", "给", "继之", "继后", "继而", "综上所述", "罢了", "者", "而", "而且", "而况", "而后", "而外", "而已", "而是", "而言", "能", "能否", "腾", "自", "自个儿", "自从", "自各儿", "自后", "自家", "自己", "自打", "自身", "至", "至于", "至今", "至若", "致", "般的", "若", "若夫", "若是", "若果", "若非", "莫不然", "莫如", "莫若", "虽", "虽则", "虽然", "虽说", "被", "要", "要不", "要不是", "要不然", "要么", "要是", "譬喻", "譬如", "让", "许多", "论", "设使", "设或", "设若", "诚如", "诚然", "该", "说来", "诸", "诸位", "诸如", "谁", "谁人", "谁料", "谁知", "贼死", "赖以", "赶", "起", "起见", "趁", "趁着", "越是", "距", "跟", "较", "较之", "边", "过", "还", "还是", "还有", "还要", "这", "这一来", "这个", "这么", "这么些", "这么样", "这么点儿", "这些", "这会儿", "这儿", "这就是说", "这时", "这样", "这次", "这般", "这边", "这里", "进而", "连", "连同", "逐步", "通过", "遵循", "遵照", "那", "那个", "那么", "那么些", "那么样", "那些", "那会儿", "那儿", "那时", "那样", "那般", "那边", "那里", "都", "鄙人", "鉴于", "针对", "阿", "除", "除了", "除外", "除开", "除此之外", "除非", "随", "随后", "随时", "随着", "难道说", "非但", "非徒", "非特", "非独", "靠", "顺", "顺着", "首先", "！", "，", "：", "；", "？",
    "生日会","官网","直通车","婚姻",
    "6000", "4000",  "研究生", "推荐","啊", "阿", "哎", "哎呀", "哎哟", "唉", "俺", "俺们", "按", "按照", "吧", "吧哒", "把", "罢了", "被",
    "本", "本着", "比", "比方", "比如", "鄙人", "彼", "彼此", "边", "别", "别的", "别说", "并", "并且",
    "不比", "不成", "不单", "不但", "不独", "不管", "不光", "不过", "不仅", "不拘", "不论", "不怕", "不然",
    "不如", "不特", "不惟", "不问", "不只", "朝", "朝着", "趁", "趁着", "乘", "冲", "除", "除此之外", "除非",
    "除了", "此", "此间", "此外", "从", "从而", "打", "待", "但", "但是", "当", "当着", "到", "得", "的",
    "的话", "等", "等等", "地", "第", "叮咚", "对", "对于", "多", "多少", "而", "而况", "而且", "而是", "而外",
    "而言", "而已", "尔后", "反过来", "反过来说", "反之", "非但", "非徒", "否则", "嘎", "嘎登", "该", "赶", "个",
    "各", "各个", "各位", "各种", "各自", "给", "根据", "跟", "故", "故此", "固然", "关于", "管", "归", "果然",
    "果真", "过", "哈", "哈哈", "呵", "和", "何", "何处", "何况", "何时", "嘿", "哼", "哼唷", "呼哧", "乎", "哗",
    "还是", "还有", "换句话说", "换言之", "或", "或是", "或者", "极了", "及", "及其", "及至", "即", "即便",
    "即或", "即令", "即若", "即使", "几", "几时", "己", "既", "既然", "既是", "继而", "加之", "假如", "假若",
    "假使", "鉴于", "将", "较", "较之", "叫", "接着", "结果", "借", "紧接着", "进而", "尽", "尽管", "经", "经过",
    "就", "就是", "就是说", "据", "具体地说", "具体说来", "开始", "开外", "靠", "咳", "可", "可见", "可是",
    "可以", "况且", "啦", "来", "来着", "离", "例如", "哩", "连", "连同", "两者", "了", "临", "另", "另外",
    "另一方面", "论", "嘛", "吗", "慢说", "漫说", "冒", "么", "每", "每当", "们", "莫若", "某", "某个", "某些",
    "拿", "哪", "哪边", "哪儿", "哪个", "哪里", "哪年", "哪怕", "哪天", "哪些", "哪样", "那", "那边", "那儿",
    "那个", "那会儿", "那里", "那么", "那么些", "那么样", "那时", "那些", "那样", "乃", "乃至", "呢", "能",
    "你", "你们", "您", "宁", "宁可", "宁肯", "宁愿", "哦", "呕", "啪达", "旁人", "呸", "凭", "凭借", "其",
    "其次", "其二", "其他", "其它", "其一", "其余", "其中", "起", "起见", "岂但", "恰恰相反", "前后", "前者",
    "且", "然而", "然后", "然则", "让", "人家", "任", "任何", "任凭", "如", "如此", "如果", "如何", "如其",
    "如若", "如上所述", "若", "若非", "若是", "啥", "上下", "尚且", "设若", "设使", "甚而", "甚么", "甚至",
    "省得", "时候", "什么", "什么样", "使得", "是", "是的", "首先", "谁", "谁知", "顺", "顺着", "似的", "虽",
    "虽然", "虽说", "虽则", "随", "随着", "所", "所以", "他", "他们", "他人", "它", "它们", "她", "她们",
    "倘", "倘或", "倘然", "倘若", "倘使", "腾", "替", "通过", "同", "同时", "哇", "万一", "往", "望", "为",
    "为何", "为了", "为什么", "为着", "喂", "嗡嗡", "我", "我们", "呜", "呜呼", "乌乎", "无论", "无宁",
    "毋宁", "嘻", "吓",
    "激光", "点云",  "调研", "None", "参数", "生成", "调度",
    "以太网", "修正",  "附带", "静态", "动效",  "品牌设计",
     "产品原型", "交互设计",
    "假如", "假设", "例如", "比方","负责", "参与", "协助", "完成", "进行", "开展", "实施", "跟进", "处理", "优化",
    "维护", "管理", "设计", "编写", "测试", "分析", "评估", "解决", "研究", "提供",
    "支持", "对接", "沟通", "协调", "推动", "创新", "提升", "确保", "监督", "指导",
    "相关", "优秀", "良好", "较强", "熟悉", "了解", "掌握", "精通", "熟练", "具备",
    "招聘", "工作", "职责", "要求", "待遇", "福利", "经验", "学历", "专业", "技能",
    "能力", "素质", "团队", "环境", "发展", "机会", "部门", "全职","优先", "岗位职责", "任职", "以上", "产品", "一金", "技术", "需求", "具有",
    "使用", "学习", "本科", "项目", "职位", "开发", "公司", "服务", "问题","关系", "统招", "学历", "餐补","富有", "以上学历", "保证", "经理", "持续", "输出", "把握", "热爱",
    "五险", "独立", "业务", "学历", "员工", "根据", "工具", "制作", "界面","组织", "补充", "调薪", "餐补", "享受", "每年",
    "理解", "界面设计", "软件", "双休", "带薪", "周末", "整体", "视觉", "移动","或者", "18", "压力", "节假日", "运行", "拥有", "30", "APP", "大专", "调薪", "媒体",
    "前端", "用户", "交互", "趋势", "规范", "合作", "设计规范", "风格", "美术","大厦", "金升", "培训", "分钟", "办公", "运维", "线上", "面试", "每年", "运用", "自己", "需要"
    "创意", "流程", "体验", "工具", "功能", "00", "网站", "节日", "性能","显示", "功耗", "快速", "进程", "接受", "智能", "车载", "组件", "安卓",
    "稳定性", "内存", "调试", "功能", "店铺", "更新", "活动", "拍摄","办公", "修改", "促销", "电商", "时间", "日常", "销售", "修图", "后期", "淘宝", "营销", "策划", "自己", "广告",
    "框架", "文档", "一定", "熟练掌握", "以及", "代码", "系统", "学历","编程语言", "方向", "自动化", "常见", "最新", "背景", "硕士", "数学", "训练",
    "应用", "岗位", "实现", "能够", "配合", "常用", "补助", "旅游","工程", "控制", "编程语言", "规划", "仿真", "落地", "电子", "论文", "信号处理", "硕士", "方法", "理论", "训练",
    "定期", "协作", "至少", "绩效奖金", "主流", "核心", "原则", "基础","整机", "资料", "文件", "绘制", "接受", "日本", "电力", "过程","緩存",
    "平台", "模块", "责任心", "包括", "实际", "考虑", "精神", "数据",
    "质量", "任务", "协议", "习惯", "计算机相关", "互联网", "行业",
    "产品设计", "审美", "功底", "设计方案", "作品", "提出", "制定",
    "运营", "装修", "海报", "详情页", "商品", "网页", "美化", "视频",
    "主图", "推广", "薪资", "图片", "宣传", "排版", "加班",
    "解决问题", "编程", "页面", "研发", "部署", "计算机", "语言",
    "数据库", "各种", "其他", "意识", "架构", "设计模式", "开源",
    "丰富", "操作系统", "内容", "建设", "搭建", "职业", "网络",
    "知识", "验证", "基于", "学历", "扎实", "主动", "体检", "医疗保险",
    "年底", "年底调薪", "限于", "基本", "逻辑", "完整", "生产", "完善",
    "示波器", "功率", "单片机", "通讯", "BOM", "电气", "模拟",
    "合理", "资格", "强烈", "清晰", "亮点", "最终", "不断", "目标",
    "准确",  "实践经验", "深入", "迭代", "程序",
    "大型", "工程师", "配置", "晋升", "原理", "解决方案", "善于", "操作",
    "关注", "案例",  "各类", "构建", "工程化", "标准", "后台",
    "阅读", "改进", "高效", "高质量", "架构设计", "调优", "接口", "并发",
    "集成", "双薪", "12", "10", "计算", "客户",
    "通信",  "脚本", "操作", "分项", "机器", "模型", "复杂",
     "蓝牙",  "驱动", "英文", "客户端", "开发工具", "全勤奖",
    "法定", "首页", "文案", "福利待遇", "精修", "产品图片", "一年", "团建",
    "视觉效果", "京东", "控件", "手机", "客户端", "卖点", "品牌", "详情",
     "编辑", "需要", "美工", "奖金", "摄影", "搭配",
    "描述", "展示", "全职", "天猫", "网店", "创意设计", "思维", "感知",
    "领域", "量化",  "跟踪", "分类", "检测", "分割", "发表",
     "目标检测", "行为", "信号", "推理", "针对", "融合",
    "定位",  "机器人", "现场", "交通", "安全", "芯片", "诊断",
     "承担", "系列", "日语", "银行", "control", "网络协议", "即可",
    "底层", "逻辑思维", "数字", "资源", "图形学", "三维", "虚拟", "物理",
    "shader", "特效", "插件", "动画", "一款",
    "引擎", "游戏", "展示", "场景", "样机", "选型", "焊接", "逆变器",
    "技术支持", "ARM", "量产", "量产", "仪器", "方案设计",
    "器件", "元器件", "电源", "原理图", "高速",
    "评审", "嵌入式", "数字电路",
    "Web", "入职", "反馈", "执行", "不同", "免费", "补贴", "礼金",
    "安排", "主要", "抖音", "亚马逊", "CDR", "表达", "色彩",
    "加入", "及时", "方面", "调整", "物料",
     "跨境", "构图", "特点", "人员", "素材", "独特",
    "认真", "提高", "平面", "宝贝", "拍照", "氛围", "美工设计",
    "ps", "编码", "数据结构", "功能模块", "思想", "机制", "实践",
    "交付", "软件开发", "特性", "自定义", "弹性", "前端开发",
    "数据处理", "效率", "前后", "高度", "负载", "内部", "跨平台",
    "加速", "导航", "定制", "车机", "线程", "WMS", "HTTP", "方案",
    "试用期", "实践", "前沿技术", "电机", "工业", "传感器", "多种",
    "汽车", "预测", "经历", "相应", "出差", "产品开发", "稳定",
    "打包", "计划", "PC", "Socket", "接入", "发布", "阶段",
    "动手", "万用表", "编制", "撰写", "工艺", "补贴", "控制器",
    "layout", "电子产品", "成本", "详细", "归档", "整理", "基础知识",
    "大功率", "开关电源", "归档", "产品开发",
    "现有", "渴望", "多次", "发现", "享有", "生日",
    "帮助", "之间", "社保", "包吃", "综合", "上班时间",
    "市场", "上班", "模板", "传达",
    "策略", "轻松", "上级", "毕业", "底薪",
    "领导", "形象设计", "做事", "渲染",
    "创意", "上班", "模板","速卖通","水平","5000","投递","聚餐","做出","购买","会议","1688","剪辑",
    "理念", "构思", "传达", "执行力", "策略", "企业","小时","阿里巴巴","5000","达芬奇", "banner","充分","水平","做出",
    "开发技术", "网络通信", "层面", "四大", "原生",
    "座舱", "PMS", "AMS", "上班", "专题", "渲染",
    "强化", "业界", "网格", "遥感", "统计学", "美团",
    "任意", "RH850", "LIN", "英飞凌", "联调", "心理学",
    "方式", "积极参与", "pc", "攻关", "U3D", "阳光",
    "适配", "多年", "联调",  "设备",
    "故障", "整改", "试验", "布线", "总线", "伺服",
    "储能", "拓扑", "DC", "Layout", "按照",
    "承受", "年度", "认识", "休息", "假期", "调色",
    "下午茶", "包住", "工资", "提成", "表现", "细致",
     "PR", "上传",  "结合",
     "想法",  "从事", "结构",
    "效果", "测量", "文献", "文本", "面向对象", "适应",
    "售后", "关键", "出现", "单板",  "制造",
    "有效", "重构", "升级", "包装", "下午", "突出",
    "兼职", "简单", "主页", "食堂", "面向对象编程",
    "功能设计",  "光伏", "指标",
    "测控", "仪器仪表", "确认", "可行性",
    "讨论", "建议", "表达能力", "理解能力",
    "注重", "抗压", "用户界面", "艺术设计", "流行",
    "易用性",  "兼职", "细心",
     "多多", "绩效",
    "信息", "启动", "预研", "技巧", "13",
    "专科", "突出", "优势", "版本控制",
    "自我", "软件产品",  "个人", "简单",
    "下午", "体系", "包装", "兼职", "主页"
     "追求", "转化率", "产假", "缴纳", "欢迎",
    "符合", "产品描述", "不用", "独到", "版面",
    "主题",
     "成长", "上线",
    "角度", "推进",  "美感",
    "形象", "符合", "订单", "app", "应用程序",
    "存储", "SDK",  "框架", "模式",
    "软件架构", "定义", "多线程", "成员", "追求",
    "前沿", "探索", "研究成果", "具体", "以下",
    "and", "电子信息", "运动", "多个", "建模",
    "搜索", "雷达", "控制算法", "3D", "内核",
    "嵌入式软件", "diva", "网络管理", "硬件",
    "有瑞萨",
    "贴图", "光照", "充电",
    "规格书", "变频器", "电磁兼容", "信息工程",
    "部分", " Designer", "AD", "及其", "可靠性",
    "交办", "地点", "自由", "上架", "住宿",

    "店面", "作图", "正常", "期待",

    "呈现", "海报设计", "审美观",

    "竞争力", "展厅", "一站式", "紧密", "年终奖",

    "认证", "医疗", "安规", "班车", "电子相关",

    "电路", "设计师", "UI",

    "简历", "细节", "美术设计",

    "平面设计", "创造力", "设定", "人机交互",

    "图形", "布局", "端的", "简历",

    "抽象", "模块化", "给出", "关键技术", "应用层",

    "遇到", "版本",  "利用", "移植",

    "特定", "自动", "竞争力", "远程",

    "演示", "展厅", "紧密", "扩展",

    "粒子", "管线", "后台程序",

    "上述", "演示", "年终奖",

     "多人", "演示",

    "展厅", "一站式", "紧密", "管线", "虚拟现实"
    "春节", "创业",  "按时",

    "不定期", "保险", "大小", "礼品", "调性",

    "态度", "转正", "广告设计", "Banner",

     "思考",  "空间",

    "应届", "国际", "薪酬", "不定期",

    "按时",

    "活跃", "交代", "一起", "智慧", "WebGL",

    "一次", "项目经理", "专业培训",

    "联网", "交代", "一次", "认知", "API",

    "Demo", "Three", "高级",

    "报告", "元件", "主导", "试产", "材料",

    "其它", "检查", "数电", "模电", "软硬件",

    " Designer", "测试报告", "英语",
    "春节", "商城", "小红书", "11", "达到",

    "肯干", "大促", "100", "这边", "做好",

    "处理软件", "敏捷", "文化", "大屏", "嵩山",

    "烘培", "课件", "共同", "两年", "多端",

    "应用软件", "导入", "国家", "驱动器", "进度",

    "变流器", "外围", "SPI",

    "积极主动", "认真负责", "踏实",

    "按时完成", "按时", "按时交付", "按时提交",
    "上午", "出口", "主管", "cdr", "展现",

    "应届生", "年龄", "布置", "画册",

    "图文并茂", "毕业生", "心健", "成品", "更佳",

    "服务端", "50", "iso", "一体化", "风险",

    "the", "中心", "design", "STM32", "Allegro",
    "!","\"","#","$","%","&","'","(",")","*","+",",","-","--",".","..","...","......","./",".一",".数",".日","/","//","0","1","2","3","4","5","6","7","8","9",":","://","::",
    ";","<","=",">",">>","?","@","A","Lex","[","\\","]","^","_","`","exp","sub","sup","|","}","~","~~~~","·","×","×××","Δ","Ψ","γ","μ","φ","φ．","В","—","——","———","‘","’",
    "’‘","“","”","”，","……","…………………………………………………③","′∈","′｜","℃","Ⅲ","↑","→","∈［","∪φ∈","≈","①","②","②ｃ","③","③］","④","⑤","⑥","⑦","⑧","⑨","⑩","──","■","▲","　","、",
    "。","〈","〉","《","》","》），“","」","『","』","【","】","〔","〕","〕〔","㈧","一","一.","一一","一下","一个","一些","一何","一切","一则","一则通过","一天","一定","一方面","一旦","一时","一来","一样","一次",
    "一片","一番","一直","一致","一般","一起","一转眼","一边","一面","七","万一","三","三天两头","三番两次","三番五次","上","上下","上升","上去","上来","上述","上面","下","下列","下去","下来","下面","不","不一","不下",
    "不久","不了","不亦乐乎","不仅","不仅...而且","不仅仅","不仅仅是","不会","不但","不但...而且","不光","不免","不再","不力","不单","不变","不只","不可","不可开交","不可抗拒","不同","不外","不外乎","不够","不大","不如","不妨",
    "不少","不尽","不尽然","不巧",

    "不已",

    "不常",

    "不得",

    "不得不",

    "不得了",

    "不得已",

    "不必",

    "不怎么",

    "不怕",

    "不惟",

    "不成",

    "不拘",

    "不择手段",

    "不敢",

    "不料",

    "不断",

    "不日",

    "不时",

    "不是",

    "不曾",

    "不止",

    "不止一次",

    "不比",

    "不消",

    "不满",

    "不然",

    "不然的话",

    "不经意",

    "不胜",

    "不能",

    "不能不",

    "不至于",

    "不若",

    "不要",

    "不论",

    "不起",

    "不限",

    "不问",

    "不完全",

    "不一定",

    "以及",

    "以及其它",

    "与此同时",

    "专门",

    "且",

    "且不说",

    "且说",

    "两者",

    "严格",

    "严重",

    "个",

    "个人",

    "个别",

    "中小",

    "中间",

    "丰富",

    "串行",

    "临",

    "临到",

    "为",

    "为主",

    "为了",

    "为什么",

    "为什麽",

    "为何",

    "为止",

    "为此",

    "为着",

    "主张",

    "主要",

    "举凡",

    "举行",

    "乃",

    "乃至",

    "乃至于",

    "么",

    "之",

    "之一",

    "之前",

    "之后",

    "之後",

    "之所以",

    "之类",

    "乌乎",

    "乎",

    "乒",

    "乘",

    "乘势",

    "乘机",

    "乘胜",

    "乘虚",

    "乘隙",

    "九",

    "也",

    "也好",

    "也就是说",

    "也是",

    "也罢",

    "了",

    "了解",

    "争取",

    "二",

    "二来",

    "二话不说",

    "二话没说",

    "于",

    "于是",

    "于是乎",

    "云云",

    "云尔",

    "互",

    "互相",

    "五",

    "些",

    "交口",

    "亦",

    "产生",

    "亲口",

    "亲手",

    "亲眼",

    "亲自",

    "亲身",

    "人",

    "人人",

    "人们",

    "人家",

    "人民",

    "什么",

    "什么样",

    "什麽",

    "仅",

    "仅仅",

    "今",

    "今后",

    "今天",

    "今年",

    "今後",

    "介于",

    "仍",

    "仍旧",

    "仍然",

    "从",

    "从不",

    "从严",

    "从中",

    "从事",

    "从今以后",

    "从优",

    "从古到今",

    "从古至今",

    "从头",

    "从宽",

    "从小",

    "从新",

    "从无到有",

    "从早到晚",

    "从未",

    "从来",

    "从此",

    "从此以后",

    "从而",

    "从轻",

    "从速",

    "从重",

    "他",

    "他人",

    "他们",

    "他是",

    "他的",

    "代替",

    "以",

    "以上",

    "以下",

    "以为",

    "以便",

    "以免",

    "以前",

    "以及",

    "以后",
]


def classify_jobs(jobs):
    classified_data = {
        "Java开发": [],
        "UI设计师": [],
        "Web前端": [],
        "PHP": [],
        "Python": [],
        "Android": [],
        "美工": [],
        "深度学习": [],
        "算法工程师": [],
        "Hadoop": [],
        "Node.js": [],
        "C": [],
        "U3D": [],
        "硬件工程师": [],
        "单片机": []
    }

    for job in jobs:
        position_name = job[3]
        description = ' '.join(map(str, [job[21]]))  # 提取特定字段

        # 根据position_name进行分类
        if "Java" in position_name:
            classified_data["Java开发"].append(description)
        elif "UI" in position_name:
            classified_data["UI设计师"].append(description)
        elif "Web" in position_name:
            classified_data["Web前端"].append(description)
        elif "PHP" in position_name:
            classified_data["PHP"].append(description)
        elif "Python" in position_name:
            classified_data["Python"].append(description)
        elif "Android" in position_name:
            classified_data["Android"].append(description)
        elif "美工" in position_name:
            classified_data["美工"].append(description)
        elif "深度学习" in position_name:
            classified_data["深度学习"].append(description)
        elif "算法" in position_name:
            classified_data["算法工程师"].append(description)
        elif "Hadoop" in position_name:
            classified_data["Hadoop"].append(description)
        elif "Node" in position_name:
            classified_data["Node.js"].append(description)
        elif "C" in position_name:
            classified_data["C"].append(description)
        elif "U3D" in position_name:
            classified_data["U3D"].append(description)
        elif "硬件" in position_name:
            classified_data["硬件工程师"].append(description)
        elif "单片" in position_name:
            classified_data["单片机"].append(description)

    return classified_data

def segment_and_save(cursor, classified_data):
    # 清空type表数据
    try:
        cursor.execute("TRUNCATE TABLE type")
        print("Cleared data from 'type' table.")
    except Exception as e:
        print(f"Failed to clear 'type' table: {str(e)}")

    for job_type, descriptions in classified_data.items():
        all_words = []  # 用于存储所有描述的分词结果
        # 统计词频
        word_freq = {}
        for description in descriptions:
            # 使用jieba进行分词
            words = jieba.cut(description)


            for word in words:
                if word not in stop_words and len(word) > 1:  # 排除停用词和长度为1的词
                    word_freq[word] = word_freq.get(word, 0) + 1

        # 选取出现频率最高的词，并按频率排序
        sorted_word_freq = sorted(word_freq.items(), key=lambda x: x[1], reverse=True)
        top_words = [word[0] for word in sorted_word_freq[:40]]  # 选取出现频率最高的前40个词

        # 将词列表添加到all_words中
        all_words.extend(top_words)

        # 将所有描述的分词结果去重后用逗号连接成字符串
        segmented_text = ','.join(set(all_words))

        # 检查segmented_text是否为空，如果为空则不保存当前分类的数据
        if segmented_text:
            # 将分类名称和分词后的字符串保存到数据库
            try:
                sql = "INSERT INTO type (name, descstr) VALUES (%s, %s)"
                cursor.execute(sql, (job_type, segmented_text))
                db.commit()
                print(f"Successfully saved {job_type} data.")
            except Exception as e:
                db.rollback()
                print(f"Failed to save {job_type} data: {str(e)}")
        else:
            print(f"Segmented text for {job_type} is empty. Skipping...")

if __name__ == '__main__':
    # mysql 数据库连接
    db = pymysql.connect(host='127.0.0.1', user='root', password='123456', port=3306, database='flask_job',
                         charset='utf8')

    # 使用cursor()方法获取操作游标
    cursor = db.cursor()

    sql = "SELECT * FROM tb_job2"
    cursor.execute(sql)
    jobs = cursor.fetchall()

    # 对数据进行分类
    classified_data = classify_jobs(jobs)

    # 对每个分类进行分词，并将结果保存到数据库
    segment_and_save(cursor, classified_data)

    # 关闭游标和数据库连接
    cursor.close()
    db.close()
